<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class NewsController extends Controller
{
    public static function index()
    {
        $news = [
            [
                'title' => '
            बैंकर र व्यवसायी छुट्ट्याउने दिशामा ‘बाफिया’ : एक प्रतिशत सेयर हुनेले ऋण नपाउने',
                'description' => '८ चैत, काठमाडौं । सरकारले बैंकर र व्यवसायीलाई अलग्याउने स्पष्ट व्यवस्था सहित ‘बैंक तथा वित्तीय संस्था सम्बन्धी ऐन’ (बाफिया) संशोधन प्रस्ताव संसद्‍मा दर्ता गराएको छ ।
            सरकारले दर्ता गरेको बाफिया संशोधनले दफा ५२ मा संशोधन गरी कुनै बैंकमा उल्लेख्य स्वामित्व भएको व्यक्तिलाई कुनै किसिमको कर्जा वा सुविधा प्रदान गरिने छैन भन्ने उल्लेख छ ।',
                'id' => 1,

            ],
            [
                'title' => '
                सिडिओले मिडियाको निगरानी गर्ने निर्देशनबाट पछि हट्यो गृह मन्त्रालय',
                'description' => '८ चैत, काठमाडौं । गृह मन्त्रालयले आमसञ्चारमाध्यमका विषय निगरानी र कारबाही चलाउन प्रमुख जिल्ला अधिकारीहरुलाई गरेको परिपत्र सच्याएको छ ।
                ७७ जिल्लाका प्रमुख जिल्ला अधिकारीहरुलाई बिहीबार पठाएको परिपत्रमा अनलाइन तथा छापा सञ्चारमाध्यमको अनुगमन र कारबाही गर्न जिल्ला प्रशासन कार्यालयमा डेस्क राख्ने उल्लेख थियो ।',
                'id' => 2,

            ],

        ];
        return view('welcome', ['news' => $news]);
    }

    public static function displayNews()
    {
        return view('news', ['title' => 'hey', 'description' => 'yolo']);
    }
}
